IDENTIFICATION DIVISION.
PROGRAM-ID. Main.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(2) VALUE 10.
01 TEMP PIC 9(2).
01 REMA PIC 9(2).
PROCEDURE DIVISION.
A100-MAIN.
    PERFORM UNTIL NUM > 55
        DIVIDE NUM BY 3 GIVING TEMP REMA 
        IF NUM NOT = 16 AND REMA > 0 AND TEMP * 3 NOT = NUM THEN
            DISPLAY NUM
        END-IF
        ADD 2 TO NUM
    END-PERFORM
    STOP RUN.
